Autodesk.Revit.DB.BaseExportOptions.SetExportFontTable(Autodesk.Revit.DB.ExportFontTable)
Sets font table to option.
fontTable:
The font table to be set.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.BaseExportOptions.GetExportFontTable
Gets font table.
Since:
2013

Autodesk.Revit.DB.BaseExportOptions.SetExportPatternTable(Autodesk.Revit.DB.ExportPatternTable)
Sets the pattern table to use during export.
patternTable:
The pattern table to be set.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.BaseExportOptions.GetExportPatternTable
Gets a copy of the pattern table.
Returns:
The pattern table.
Since:
2014

Autodesk.Revit.DB.BaseExportOptions.SetExportLinetypeTable(Autodesk.Revit.DB.ExportLinetypeTable)
Sets the line type table to use during export.
linetypeTable:
The line type table to be set.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.BaseExportOptions.GetExportLinetypeTable
Gets a copy of the line type table.
Returns:
The line type table.
Since:
2014

Autodesk.Revit.DB.BaseExportOptions.SetExportLayerTable(Autodesk.Revit.DB.ExportLayerTable)
Sets layer table back to option
layerTable:
The layer table to be set
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.BaseExportOptions.GetExportLayerTable
Gets the layer table.
Returns:
The layer table.
Since:
2014

Autodesk.Revit.DB.BaseExportOptions.GetPredefinedSetupNames(Autodesk.Revit.DB.Document)
Returns a list of names of predefined setups of export options.
Remarks:
The predefined setups may be used for export to both DWG and DXF formats.
To get predefined options in the desired format use the static method
getPredefinedOptions defined in DWGExportOptions or DXFExportOptions respectively.
document:
A Revit document to retrieve names from.
Returns:
An array of strings representing names of predefined setups.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.BaseExportOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.BaseExportOptions.PreserveCoincidentLines
Whether or not to preserve coincident lines.
Default value is false.
Since:
2015 Subscription Update

Autodesk.Revit.DB.BaseExportOptions.HideUnreferenceViewTags
Whether or not to hide unreference view tags.
Default value is false.
Since:
2013

Autodesk.Revit.DB.BaseExportOptions.HideReferencePlane
Whether or not to hide reference planes.
Default value is false.
Since:
2013

Autodesk.Revit.DB.BaseExportOptions.HideScopeBox
Whether or not to hide the scope box.
Default value is false.
Since:
2013

Autodesk.Revit.DB.BaseExportOptions.Colors
Export color mode.
Default value is ExportColorMode.IndexColors.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.BaseExportOptions.HatchPatternsFileName
Custom hatch patterns (pat) file name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.BaseExportOptions.LayerMapping
Name of a layer settings standard or filename (with custom layer settings).
Valid standards are: DGNV7 (only for DGN), AIA, CP83, BS1192, and ISO13567.
default value is "" (empty) which means if no value is set,
if no value is set, Revit will use a default value according to the localization.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.BaseExportOptions.PropOverrides
How to export overridden object styles.
Default value is PropOverrideMode.ByEntity.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.BaseExportOptions
The base class for options used to export DWG, DXF and DGN format files.
Since:
2013